package com.example.simpleconverter.models;

public enum Unit {

    RUB("Рубль", 0.014), USD("Доллар", 0.761789), GBP("Фунт", 1.454334),EUR("Евро", 1),CHF("Швейцарский франк",0.646747),
    SEK("Шведская Крона", 0.110558), DKK("Датская Крона", 0.134371), NOK("Норвежская Крона", 0.121708),SGD("Сингапурский доллар", 0.468867), INR("Рупия", 0.017494), AED("Дирхам", 0.207577),
    KRW("Вона", 0.000758), THB("Бат", 0.019682),ILS("Шекель", 0.175688),JPY("Иена", 0.007261), UAH("Гривна", 0.037),

    KILOGRAM("Килограмм", 1000), GRAM("Грамм", 1), MILLIGRAM("Миллиграм", 0.001), TON("Тонна", 1000000),
    GRAN("Гран", 0.0648), OUNCE("Унция", 28.350296), LB("Фунт", 453.599082),

    MM("Милиметр", 0.1), CM("Сантиметр", 1), M("Метр", 100), KM("Километр", 100000), INCH("Дюйм", 2.540005), FT("Фут", 30.480371), YD("Ярд", 91.441112), MILE("Миля", 160926.93917),

    CBCM("См^3", 1), CBM("М^3", 1000000), LITER("Литр", 1000), CBINCH("Дюйм^3", 16.38619), CBFT("Фут^3", 28315.37665), CBYD("Ярд^3", 764409.111757), GALLON("Галлон", 4546.095132),

    SQCM("См^2", 1), SQM("М^2", 10000), ARE("Ар", 1000000), SQINCH("Дюйм^2", 6.451613), SQFT("Фут^2", 929.022668), SQYD("Ярд^2", 8361.204013), ACRE("Акр", 40469445.568596), HA("Гектар", 100000000), SQMILE("Миля^2", 25899891738.4525),

    C("°C", 1), F("°F", -17.222222);

    private final String mName;
    private final double mProportion;

    public String getName() {
        return mName;
    }

    public double getProportion() {
        return mProportion;
    }


    Unit(String name, double proportion) {
        mName = name;
        mProportion = proportion;
    }
}
